; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared0 - mode
	spectrograph1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	GroundStation9 - direction
	GroundStation1 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet11)
)
(:goal (and
	(have_image Planet10 infrared0)
	(have_image Planet11 infrared2)
	(have_image Planet12 infrared2)
	(have_image Phenomenon13 spectrograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 4
2. (turn_to satellite0 groundstation1 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 4
3. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 4
4. (turn_to satellite0 phenomenon13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon13)
   goals met: 0 of 4
5. (take_image satellite0 phenomenon13 instrument0 spectrograph1)
   added: (have_image phenomenon13 spectrograph1)
   goals met: 1 of 4
6. (turn_to satellite0 planet10 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet10)
   goals met: 1 of 4
7. (take_image satellite0 planet10 instrument0 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 2 of 4
8. (turn_to satellite0 planet11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet11)
   goals met: 2 of 4
9. (take_image satellite0 planet11 instrument0 infrared2)
   added: (have_image planet11 infrared2)
   goals met: 3 of 4
10. (turn_to satellite0 planet12 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet12)
   goals met: 3 of 4
11. (take_image satellite0 planet12 instrument0 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 4 of 4
